In [14]:
import pandas as pd;

In [15]:
data = pd.DataFrame([1,2,3], columns=['age'])   # 1. Data Frame and basic data frame Undestand.............................................
data

   age
0    1
1    2
2    3

In [20]:
Data = {
    'Name': ['Vishal', 'om', 'Aadi', 'Mayur'],
    'age':[12,22,33,22], 
    'Department':['Computer', 'Cs', 'IT', 'AI-ML'],
    'Salary': [222222,333333,22222222,333333]
}

In [21]:
Df = pd.DataFrame(Data)
print(Df)

     Name  age Department    Salary
0  Vishal   12   Computer    222222
1      om   22         Cs    333333
2    Aadi   33         IT  22222222
3   Mayur   22      AI-ML    333333

In [22]:
print(Df.dtypes)

Name          object
age            int64
Department    object
Salary         int64
dtype: object

In [31]:
Df.head(2)

     Name  age Department  Salary
0  Vishal   12   Computer  222222
1      om   22         Cs  333333

In [33]:
Df.tail(2)

    Name  age Department    Salary
2   Aadi   33         IT  22222222
3  Mayur   22      AI-ML    333333

In [34]:
Df.shape

(4, 4)

In [35]:
Df.columns

Index(['Name', 'age', 'Department', 'Salary'], dtype='object')

In [36]:
Df.info

<bound method DataFrame.info of      Name  age Department    Salary
0  Vishal   12   Computer    222222
1      om   22         Cs    333333
2    Aadi   33         IT  22222222
3   Mayur   22      AI-ML    333333>

In [37]:
Df.describe()

             age        Salary
count   4.000000  4.000000e+00
mean   22.250000  5.777778e+06
std     8.578073  1.096309e+07
min    12.000000  2.222220e+05
25%    19.500000  3.055552e+05
50%    22.000000  3.333330e+05
75%    24.750000  5.805555e+06
max    33.000000  2.222222e+07

In [38]:
df = Df.rename(columns={'Name':'Full_name'})
df

  Full_name  age Department    Salary
0    Vishal   12   Computer    222222
1        om   22         Cs    333333
2      Aadi   33         IT  22222222
3     Mayur   22      AI-ML    333333

In [39]:
df.to_csv('Student_csv', index=False)

In [40]:
load = pd.read_csv('Student_csv')
load

  Full_name  age Department    Salary
0    Vishal   12   Computer    222222
1        om   22         Cs    333333
2      Aadi   33         IT  22222222
3     Mayur   22      AI-ML    333333